chcp 65001

REM Запуск программы с неправильным количеством аргументов выведет руководство 
findtext.exe "У лукоморья дуб зелёный (отрывок из поэмы «Руслан и Людмила»).txt" && goto err
echo Тест 1 пройден

REM Указание несуществующих файлов приведет к ошибке
findtext.exe "missingfile.txt" "яблоко" && goto err
echo Тест 2 пройден

REM Поиск пустой строки сообщит об этом и вернет значение 1
findtext.exe "У лукоморья дуб зелёный (отрывок из поэмы «Руслан и Людмила»).txt" "" && goto err
echo Тест 3 пройден

REM Обычный поиск текста в строке
findtext.exe "У лукоморья дуб зелёный (отрывок из поэмы «Руслан и Людмила»).txt" "кот" || goto err
echo Тест 4 пройден

findtext.exe "У лукоморья дуб зелёный (отрывок из поэмы «Руслан и Людмила»).txt" "run" || goto er
REM Обычный поиск текста в строке но текст не найден
echo Тест 5 пройден

REM Тесты пройдены
echo Тесты пройдены
exit /b 0

:err
echo Тесты провалены
exit /b 1