chcp 65001

REM Запуск программы с неправильным количеством аргументов выведет руководство 
findtext.exe "У лукоморья дуб зелёный (отрывок из поэмы «Руслан и Людмила»).txt" && goto err
echo Тест 1 пройден

REM Указание несуществующих файлов приведет к ошибке
findtext.exe "missingfile.txt" "яблоко" && goto err
echo Тест 2 пройден

REM Поиск пустой строки сообщит об этом и вернет значение 1
findtext.exe "У лукоморья дуб зелёный (отрывок из поэмы «Руслан и Людмила»).txt" "" && goto err
echo Тест 3 пройден

REM Обычный поиск текста в строке
findtext.exe "У лукоморья дуб зелёный (отрывок из поэмы «Руслан и Людмила»).txt" "кот" || goto err
echo Тест 4 пройден

REM Обычный поиск текста в строке но текст не найден
findtext.exe "У лукоморья дуб зелёный (отрывок из поэмы «Руслан и Людмила»).txt" "run" || goto er
echo Тест 5 пройден

REM Поиск в пустом файле, ничего не найдет
findtext.exe "Empty.txt" "кот" || goto er
echo Тест 6 пройден

REM Обычный поиск текста в строке но регистр не совпадает, ничего не найдет
findtext.exe "У лукоморья дуб зелёный (отрывок из поэмы «Руслан и Людмила»).txt" "КоТ" || goto er
echo Тест 7 пройден

REM Тесты пройдены
echo Тесты пройдены
exit /b 0

:err
echo Тесты провалены
exit /b 1