chcp 65001

REM Обычное вращение битов в байте ВЛЕВО на 3 бита , число 86 должно стать 202 (01011001 -> 10101100)
rotatebyte.exe 86 3 L || goto err
echo Тест 1 пройден

REM Обычное вращение битов в байте ВПРАВО на 3 бита, число 87 должно стать 234 (01010111 -> 11101010)
rotatebyte.exe 87 3 R || goto err
echo Тест 2 пройден

REM При указании направления в нижнем регистре все корректно обработается
rotatebyte.exe 87 3 r || goto err
echo Тест 3 пройден

REM При указании некоректных данных будет выв
rotatebyte.exe f F 1 && goto err
echo Тест 4 пройден

REM При указании некоректного количества аргументов будет выведена подсказка и ошибка
rotatebyte.exe 87 3 R 25 && goto err
echo Тест 5 пройден

REM При указании некоректного числа для байта будет выведено соответствующее сообщение и ошибка
rotatebyte.exe 256 3 R && goto err
echo Тест 6 пройден

REM При указании некоректного направления для сдвига будет выведено соответствующее сообщение и ошибка
rotatebyte.exe 87 3 Right && goto err
echo Тест 7 пройден

REM При указании некоректного числа-количества битов для сдвига будет выведено соответствующее сообщение и ошибка
rotatebyte.exe 87 -3 R && goto err
echo Тест 8 пройден


REM Тесты пройдены
echo Тесты пройдены
exit /b 0

:err
echo Тесты провалены
exit /b 1